In [1]:
import pandas as pd
students_df = pd.read_csv("students.csv")

In [2]:
students_df

     student_id student__first_name    country  age  has_rabbit
0             1               David     Brazil   31        True
1             2               Ahmet     Canada   20        True
2             3               Isaac        USA   20        True
3             4             Charlie  Indonesia   24        True
4             5               Isaac        USA   35        True
..          ...                 ...        ...  ...         ...
995         996               David   Portugal   34        True
996         997               Grace     Canada   23       False
997         998                Emma     Canada   26       False
998         999              Hannah     Brazil   24        True
999        1000               Frank        USA   33        True

[1000 rows x 5 columns]

In [3]:
students_df['country'].unique()

array(['Brazil', 'Canada', 'USA', 'Indonesia', 'Argentina', 'Poland',
       'Portugal', 'Mexico', 'Cambodja', 'Turkey', 'China'], dtype=object)

In [22]:
df1 = students_df.loc[(students_df['country'] == 'Brazil')  | (students_df['country'] == 'Canada') | (students_df['country'] == 'USA') | (students_df['country'] == 'Indonesia') | 
                                                            (students_df['country'] == 'Argentina') | (students_df['country'] == 'Poland')]
df2 = students_df.loc[(students_df['country'] == 'Portugal')  | (students_df['country'] == 'Mexico') | (students_df['country'] == 'Cambodja') | (students_df['country'] == 'Turkey') | 
                                                            (students_df['country'] == 'China') ]

In [19]:
df1

     student_id student__first_name    country  age  has_rabbit
0             1               David     Brazil   31        True
1             2               Ahmet     Canada   20        True
2             3               Isaac        USA   20        True
3             4             Charlie  Indonesia   24        True
4             5               Isaac        USA   35        True
..          ...                 ...        ...  ...         ...
994         995               Ahmet     Brazil   38       False
996         997               Grace     Canada   23       False
997         998                Emma     Canada   26       False
998         999              Hannah     Brazil   24        True
999        1000               Frank        USA   33        True

[556 rows x 5 columns]

In [23]:
df2['country'].unique()

array(['Portugal', 'Mexico', 'Cambodja', 'Turkey', 'China'], dtype=object)

In [40]:
array = len(students_df['country'].unique())

In [43]:
if (array)%2 == 0:
        for j in range(0, ((array)/2)):
               dfn = students_df.loc[(students_df['country'] == array[j])]
else: 
        for j in range(0, ((array)/2 + 1/2)):
               dfn = students_df.loc[(students_df['country'] == array[j])]

TypeError: 'float' object cannot be interpreted as an integer

In [35]:
dfn

NameError: name 'dfn' is not defined